noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430fg478.h
#define OA0CTL0_            (0x00C0u)  /* OA0 Control register 0 */
DEFC(   OA0CTL0           , OA0CTL0_)
#define OA0CTL1_            (0x00C1u)  /* OA0 Control register 1 */
DEFC(   OA0CTL1           , OA0CTL1_)
#define OA1CTL0_            (0x00C2u)  /* OA1 Control register 0 */
DEFC(   OA1CTL0           , OA1CTL0_)
#define OA1CTL1_            (0x00C3u)  /* OA1 Control register 1 */
DEFC(   OA1CTL1           , OA1CTL1_)
#define OASWCTL0_           (0x00CE)  /* OA  Analog Switches Control Register 0 */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   OASWCTL0          , OASWCTL0_)
#endif
#define OASWCTL0L_          (0x00CE)  /* OA  Analog Switches Control Register 0 Low Byte */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   OASWCTL0L         , OASWCTL0L_)
#endif
#define OASWCTL0H_          (0x00CF)  /* OA  Analog Switches Control Register 0 High Byte */
#ifndef __IAR_SYSTEMS_ICC__
DEFC(   OASWCTL0H         , OASWCTL0H_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXC                               OASWCTL0L;
  DEFXW                               OASWCTL0;
} @ 0x00CE;
#endif
#define SWCTL               OASWCTL0H /* OA  Analog Switches Control Register 0 High Byte */

#define OAADC0              (0x01)    /* OAx output to ADC12 input channel select 0 */
#define OAADC1              (0x02)    /* OAx output to ADC12 input channel select 1 */
#define OAPM0               (0x04)    /* OAx Power mode select 0 */
#define OAPM1               (0x08)    /* OAx Power mode select 1 */
#define OAP0                (0x10)    /* OAx Non-inverting input select 0 */
#define OAP1                (0x20)    /* OAx Non-inverting input select 1 */
#define OAN0                (0x40)    /* OAx Inverting input select 0 */
#define OAN1                (0x80)    /* OAx Inverting input select 1 */

#define OAPM_0              (0x00)    /* OAx Power mode select: off */
#define OAPM_1              (0x04)    /* OAx Power mode select: slow */
#define OAPM_2              (0x08)    /* OAx Power mode select: meduim */
#define OAPM_3              (0x0C)    /* OAx Power mode select: fast */
#define OAP_0               (0x00)    /* OAx Non-inverting input select 00 */
#define OAP_1               (0x10)    /* OAx Non-inverting input select 01 */
#define OAP_2               (0x20)    /* OAx Non-inverting input select 10 */
#define OAP_3               (0x30)    /* OAx Non-inverting input select 11 */
#define OAN_0               (0x00)    /* OAx Inverting input select 00 */
#define OAN_1               (0x40)    /* OAx Inverting input select 01 */
#define OAN_2               (0x80)    /* OAx Inverting input select 10 */
#define OAN_3               (0xC0)    /* OAx Inverting input select 11 */

//#define OARRIP              (0x01)    /* OAx Rail-to-Rail Input off */
//#define OANEXT              (0x02)    /* OAx Inverting input external */
#define OACAL               (0x02)    /* OAx Offset Calibration */
#define OAFC0               (0x04)    /* OAx Function control 0 */
#define OAFC1               (0x08)    /* OAx Function control 1 */
#define OAFC2               (0x10)    /* OAx Function control 2 */
//#define OAFBR0              (0x20)    /* OAx Feedback resistor select 0 */
//#define OAFBR1              (0x40)    /* OAx Feedback resistor select 1 */
//#define OAFBR2              (0x80)    /* OAx Feedback resistor select 2 */

#define OAFC_0              (0x00)    /* OAx Function: Gen. Purpose */
#define OAFC_1              (0x04)    /* OAx Function: Unity gain buffer */
#define OAFC_2              (0x08)    /* OAx Function: Reserved */
#define OAFC_3              (0x0C)    /* OAx Function: Comparator */
#define OAFC_4              (0x10)    /* OAx Function: Non-inverting PGA */
#define OAFC_5              (0x14)    /* OAx Function: Cascaded non-inverting PGA */
#define OAFC_6              (0x18)    /* OAx Function: Inverting PGA */
#define OAFC_7              (0x1C)    /* OAx Function: Differential amplifier */
#define OAFBR_0             (0x00)    /* OAx Feedback resistor: Tap 0 */
#define OAFBR_1             (0x20)    /* OAx Feedback resistor: Tap 1 */
#define OAFBR_2             (0x40)    /* OAx Feedback resistor: Tap 2 */
#define OAFBR_3             (0x60)    /* OAx Feedback resistor: Tap 3 */
#define OAFBR_4             (0x80)    /* OAx Feedback resistor: Tap 4 */
#define OAFBR_5             (0xA0)    /* OAx Feedback resistor: Tap 5 */
#define OAFBR_6             (0xC0)    /* OAx Feedback resistor: Tap 6 */
#define OAFBR_7             (0xE0)    /* OAx Feedback resistor: Tap 7 */

#define SWCTL8              (0x0001u)  /* OA  Analog Switch Control 8 */
#define SWCTL9              (0x0002u)  /* OA  Analog Switch Control 9 */
//#define RESERVED            (0x0004u)  /* Reserved */
//#define RESERVED            (0x0008u)  /* Reserved */
#define SWCTL12             (0x0010u)  /* OA  Analog Switch Control 12 */
#define SWCTL13             (0x0020u)  /* OA  Analog Switch Control 13 */
//#define RESERVED            (0x0040u)  /* Reserved */
//#define RESERVED            (0x0080u)  /* Reserved */

#define SWCTL0              (0x0100u)  /* OA  Analog Switch Control 0 */
#define SWCTL1              (0x0200u)  /* OA  Analog Switch Control 1 */
//#define RESERVED            (0x0400u)  /* Reserved */
#define SWCTL3              (0x0800u)  /* OA  Analog Switch Control 3 */
#define SWCTL4              (0x1000u)  /* OA  Analog Switch Control 4 */
#define SWCTL5              (0x2000u)  /* OA  Analog Switch Control 5 */
//#define RESERVED            (0x4000u)  /* Reserved */
#define SWCTL7              (0x8000u)  /* OA  Analog Switch Control 7 */

/************************************************************
* DIGITAL I/O Port1/2
************************************************************/
#define __MSP430_HAS_PORT1__          /* Definition to show that Module is available */
#define __MSP430_HAS_PORT2__          /* Definition to show that Module is available */

